---
kind: method
id: M:Autodesk.Revit.DB.Structure.Rebar.GetRebarConstraintsManager
zh: 钢筋、配筋
source: html/0728a2e5-49db-3a7f-8f83-9db60b92f902.htm
---
# Autodesk.Revit.DB.Structure.Rebar.GetRebarConstraintsManager Method

**中文**: 钢筋、配筋

Returns an object for managing the external constraints on the Rebar element

## Syntax (C#)
```csharp
public RebarConstraintsManager GetRebarConstraintsManager()
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - The Rebar element does not have external constraints that can be edited.